app/controllers/carteiras_controller.rb

SELECT `carteiras`.* FROM `carteiras`
---
  def index
    @carteiras = Carteira.all