app/controllers/clientes_controller.rb

SELECT `clientes`.* FROM `clientes`
---
  def index
    @clientes = Cliente.all

INSERT INTO `clientes` (`nome`, `email`, `nascimento`, `senha`, `carteira`, `created_at`, `updated_at`) VALUES ('teste01', 'teste01@gmail.com', '2114-10-05', '12345', NULL, '2024-05-18 11:30:29.076023', '2024-05-18 11:30:29.076023')
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save

DELETE FROM `clientes` WHERE `clientes`.`id` = 17
---
  def destroy
    @cliente.destroy!

SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 1 LIMIT 1
---
    def set_cliente
      @cliente = Cliente.find(params[:id])