app/models/cliente.rb

  def create_carteira
    carteira = Carteira.create(saldo: 0)
    self.update(carteira: carteira.id)
---
INSERT INTO `carteiras` (`id`, `saldo`, `deposito`, `saque`, `created_at`, `updated_at`) VALUES (0, 0.0, NULL, NULL, '2024-05-18 12:22:56.977303', '2024-05-18 12:22:56.977303')
UPDATE `clientes` SET `clientes`.`carteira` = 2, `clientes`.`updated_at` = '2024-05-18 12:15:05.604396' WHERE `clientes`.`id` = 16